Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: We couldn't find any matching tweets for %(language)s at this time. Please check again later, choose a different tweet type from the menu above, or view tweets for other languages by using the language selector at the bottom of the page.
zu: Asikwazanga ukuthola amanye ama-tweet afanayo e%(language)s ngalesi sikhathi. Uyacelwa uphinde ubheke kamuva, khetha uhlobo lwama-tweet olwehlukile kule menyu engenhla, noma buka ama-tweet ezinye izilimi ngokusebenzisa ithuluzi lokukhetha ulimi ezansi kwekhasi.

source: We couldn't find any results for <strong>{q}</strong> in <strong>{l}</strong>. Maybe one of these articles will be helpful?
zu: Asikwazanga ukuthola miphumela ye <strong>{q}</strong> ku <strong>{l}</strong>. Mhlawumbe enye yala ma-athikhili izoba usizo?

source: We couldn't perform your request. Perhaps because the action is no longer applicable or you tried to perform an invalid action.
zu: Asikwazanga ukwenza isicelo sakho. Mhlawumbe yingoba lesi senzo asisebenzi noma uzame ukwenza isenzo esingenziwa.

source: Week beginning %(year)s-%(month)s-%(date)s
zu: Ukuqala kwesonto %(year)s-%(month)s-%(date)s

source: Weekly
zu: Masonto onke

source: Weekly meetings
zu: Imihlangano yamasonto onke

source: We just wanted to let you know that %(answerer)s has found a solution to a Firefox question that you're following.
zu: Besifuna nje ukukwazisa ukuthi %(answerer)s bathole isisombululo embuzweni we-Firefox owulandelayo.

source: Welcome to SUMO!
zu: Siyakwamukela ku-SUMO!

source: We need your help!
zu: Sidinga usizo lwakho!

source: We're sorry to see you go.
zu: Siyadabuka ukukuboa usishiya.

source: We've just received a request to send the username linked to this email address.
zu: Sisanda kuthola isicelo sokuba sithumele igama lomsebenzisi elisebenzisana naleli kheli le-imeyli.

source: We've made some educated guesses about your current browser and operating system.
zu: Sike saqagula ngokucabangisisa mayelana nesiphequluli sakho osisebenzisayo kanye nohlelo lokusebenza.

source: We've sent a confirmation to %(new_email)s. Please follow the link in the confirmation to change your account's email.
zu: Sithumele isiqinisekiso lapha %(new_email)s. Uyacelwa ulandele ilinki elandelayo yokuqinisekisa ukuze ushintshe i-imeyli ye-akhawunti yakho.

source: We've sent an email to any account using this address. Please follow the link in the email to reset your password.
zu: Sikuthumelele i-imeyli kunoma iyiphi i-akhawunti sisebenzisa leli kheli. Uyacelwa ulandele ilinki ku-imeyli ukuze usethe kabusha iphasiwedi yakho.

source: We've sent an email with the username to any account using {email}.
zu: Sithumelele i-imeyli negama lomsebenzisi kunoma yiyiphi i-akhawunti esebenzisa {email}.

source: We would love to find a good place for you to help users, so please send us an email with your username and the area you would like to get involved. Please feel free to add all your skills, we will try to find the right use for them :)
zu: Singathanda ukukutholela indawo elungile yokusiza abasebenzisi, ngakho sicela usithumele i-imeyli enegama lakho lomsebenzisi kanye nendawo ongathanda ukubandakanyeka kuyo. Uyacelwa ukhululeke ukufaka wonke amakhono akho, sizozama ukuwatholela indlela azosetshenziswa ngayo:)

source: What is your reply about?
zu: Imayelana nani impendulo yakho?

source: What Links Here
zu: Okuyilinki Lapha

source: What Links Here | {document}
zu: Elinkayo Lapha | {document}

source: What's New
zu: Yini Entsha

source: When German misses a level 2 change, the coverage drops to 50%, so 1% of 10%= 0.1% overall
zu: Uma iJalimane igeja izinga lesi-2 loshintsho, i-coverage yehlela ku-50%, ngakho u-1% we-10%= 0.1% sekukonke

source: When the Home page article is the only localized article and it's up to date in German, then our overall coverage is 2% of 10%=0.2% overall (+ the English coverage)
zu: Uma i-athikhili ye-Home page kuyiyo kuphela esiguquliwe futhi ngokuphelele ngesiJalimane, lapho-ke ukufundwa kwayo kungamaphesenti ama-2 kwayi-10=0.2% sekukonke (+ nokufundwa kweSingisi)

source: Where all the action happens
zu: Lapho zonke izinto zenzeka khona

source: Which category best describes your problem?
zu: Yisiphi isigaba esichaza kahle inkinga yakho?

source: Which product would you like to post a question about?
zu: Yimuphi umkhiqizo ongathanda ukuphosta umbuzo wawo?

source: While you wait
zu: Ngenkathi usalindile

source: Why should I help?
zu: Kungani kufanele ngisize?

source: Windows 8 Touch support articles
zu: Ama-athikhili okweseka i-Windows 8 Touch

source: Working with messages
zu: Ukusebenza ngemiyalezo

source: Would you like to view this page in %(language)s instead?
zu: Ungathanda ukubuka leli khasi %(language)s kunalokho?

source: Write help articles
zu: Bhala ama-athikhili okusiza

source: X-Ray Goggles
zu: Ama-X-Ray Goggles

source: Yes
zu: Yebo

source: Yes, I am.
zu: Yebo, kunjalo.

source: Yesterday
zu: Izolo

source: You
zu: Wena

source: You already flagged this content.
zu: Usufakile ifulegi kulokhu.

source: You already voted on this Article.
zu: Usuvotile kule Athikhili.

source: You already voted on this reply.
zu: Usuvotele le mpendulo vele.

source: You and 1 other replied
zu: Wena kanye nomunye o-1 niphendulile

source: You are about to approve your own edit. Please consider asking our <a href="%(url)s">reviewers</a> instead.
zu: Njengamanje uzokwamukela isilungiso sakho. Uyacelwa ukuba uke ucabange ngokubuza abethu <a href="%(url)s">ababukezi</a> esikhundleni salokho.

source: You are about to mark this revision <span class="revtime"></span> as Ready for Localization. Are you sure you wish to proceed?
zu: Njengamanje uzofaka uphawu kulesi sibukezo <span class="revtime"></span> isilungele ukwenziwa ibe eyasendaweni. Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete the avatar. <strong>This cannot be undone!</strong> You can always upload another avatar to replace the current one.
zu: Usuzodilitha i-avatar unomphela. <strong>Lokhu akuhlehliseki!</strong> Ungakwazi ukuloda enye esikhundleni sale ekhona manje.

source: You are about to permanently delete this answer. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Njengamanje uzodilitha unomphela le mpendulo. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this document. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Njengamanje uzodilitha le dokhumenti unomphela. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this image. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Usuzodilitha unomphela lo mfanekiso. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this post. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Usuzodilitha le phosti unomphela. <strong>Lokho akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this question. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Njengamanje uzodilitha unomphela lo mbuzo unomphela. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this revision. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Njengamanje uzodilitha unomphela lesi sibukezo. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this thread. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Manje usuzodilitha lolu chungechunge unomphela. <strong>Lokhu akuhlehliseki!</strong> Uzesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete this video. <strong>This cannot be undone!</strong> Are you sure you want to continue?
zu: Njengamanje uzodilitha le vidiyo unomphela. <strong>Lokhu akuhlehliseki!</strong> Unesiqiniseko sokuthi ufuna ukuqhubeka?

source: You are about to permanently delete your avatar. <strong>This cannot be undone!</strong> You can always <a href="%(upload_url)s">upload another avatar</a> to replace your current one.
zu: Njengamanje uzodilitha i-avatar yakho unomphela. <strong>Lokhu akuhlehliseki!</strong> Ungakwazi ukuba <a href="%(upload_url)s">ulode enye i-avatar</a> esikhundleni sale yamanje.

source: You are about to subscribe to:
zu: Usuzobhalisela ukuthola imibiko yalokhu:

source: You are not currently watching anything.
zu: Njengamanje ayikho into oyibukele.

source: You are not logged in.
zu: Awusayinele ukulogela ukungena.

source: You are not watching this thread
zu: Manje usubuka lolu chungechunge

source: You are now part of the Contributors group!
zu: Manje usuyingxenye yeqembu Labalekelelayo!

source: You are translating an English document which is not yet ready for localization.
zu: Uhumusha idokhumenti yesiNgisi engakalungeli ukuhunyushwa.

source: You are watching this thread
zu: Ubukele lolu chungechunge

source: You can also apply to our Buddy Program and get guidance from our more experienced contributors. Just introduce yourself in the forum for New Contributors by starting a new thread. Put your name on the thread title and tell us a bit about yourself:
zu: Ungafaka isicelo ohlelweni lwethu i-buddy Program uthole ukwelulekwa ngabanye abanegaleloabanesipiliyoni. Vele uzazise esithangamini Sabanegalelo Abasha ngokuqala uchungechunge lwengxoxo olusha. Faka igama lakho esihlokweni sochungechunge bese uchaze kafushane ngokuthi ungubani:

source: You can log in at:
zu: Ungabhalisela ukungena lapha:

source: You cannot translate this document.
zu: Awukwazi ukuhumusha le dokhumenti.

source: You can now log in.
zu: Manje usungalogela ukungena.

source: You can view the solution using the link below.
zu: Ungakwazi ukubuka isisombululo ngokusebenzisa ilinki engezansi.

source: You do not have permission to access this page.
zu: Awunayo imvume yokungena kuleli khasi.

source: You do not have permission to do that.
zu: Awunayo imvume yokwenza lokho.

source: You don't need to register to <a href="{url}">ask a question</a>.
zu: Awudingi ukuba ubhalise ku <a href="{url}">buza umbuzo</a>.

source: You have been automatically logged in.
zu: Usulogelwe ukungena ngokuzenzakalela.

source: You have been awarded the <strong>%(title)s</strong> badge!
zu: Uhlonyuliswe i <strong>%(title)s</strong> bheji!

source: You have been awarded the %(title)s badge!
zu: Uhlonyuliswe ngebheji %(title)s!

source: You have been unsubscribed.
zu: Usukhishiwe ohlwini lwababhalisele ukuthola izaziso.

source: You have exceeded the number of private messages that can be sent in a day.
zu: Usudlulile enanini lemiyalezo yasesithe evunyelwe ukuthunyelwa ngosuku.

source: You have exceeded the number of threads and replies that can be posted in a given amount of time. Please try again shortly.
zu: Seweqile enanini lochungechunge nezimpendulo ezingaphostwa esikhathini esithile. Uyacelwa ubuye uzame maduze nje.

source: You have flagged this content. A moderator will review your submission shortly.
zu: Usufakile ifulegi kulo mbhalo. Umhloli uzobukeza lokho okubukezile maduze nje.

source: You have not selected an image to upload.
zu: Awukakhethi umfanekiso ozolodwa.

source: You have successfully changed your password.
zu: Ushintshe iphasiwedi yakho ngempumelelo.

source: You have successfully changed your password. <a href="%(profile_url)s">Go back to edit profile page.</a>
zu: Ushintshe iphasiwedi yakho ngempumelelo. <a href="%(profile_url)s">Buyela emuva uyolungisa ikhasi lephrofayela.</a>

source: You may log in at https://{domain}{login_url}
zu: Ungangena lapha https://{domain}{login_url}

source: You might just make someone's day!
zu: Ungenza usuku lomunye umuntu lube ngcono!

source: You must <a href="{login_url}">log in to your account</a> to reply to posts. Please <a href="{ask_url}">start a new question</a>, if you do not have an account yet.
zu: Kufanele <a href="{login_url}">ulogele ukungena ku-akhawunti yakho</a> ukuze uphendule amaphosti. Uyacelwa<a href="{ask_url}">uqale umbuzo omusha</a>, uma ungekabi nayo i-akhawunti namanje.

source: You must have cookies enabled to login or register.
zu: Kufanele ube namakhukhi asebenzayo ukuze ukwazi ukulogela ukungena noma ukubhalisa.

source: Your account is already activated, log in below.
zu: I-akhawunti yakho isiyasebenza vele, logela ukungena lapha ngezansi.

source: Your account is successfully verified, and your question is now posted on the Mozilla community support forum.
zu: I-akhawunti iqinisekiswe ngempumelelo, manje umbuzo wakho usuphostwe esithangamini somphakathi wokweseka sakwa-Mozilla.

source: Your account was sucessfully closed!
zu: I-akhawunti yakho ivale ngempumelelo!

source: Your avatar will be resized to {size}x{size}
zu: I-avatar yakho izoguqulwa usayizi wayo ibe {size}x{size}

source: Your content is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Imininingwane yakho mifishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani kube %(limit_value)s wezinhlamvu.

source: Your email has been changed from {old_email} to {new_email}.
zu: I-imeyli yakho isishintshiwe kusukela {old_email} kuye {new_email}.

source: You replied
zu: Uphendulile

source: Your issue has been submitted successfully. You should receive a confirmation email and hear back from us shortly.
zu: Indaba yakho ibikwe ngempumelelo. Kufanele uthole isiqinisekiso esiyi-imeyli futhi sikuthinte kungekudala.

source: Your message is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Umyalezo mfishane kakhulu (%(show_value)s izinhlamvu). Kufanele okungenani %(limit_value)s izinhlamvu.

source: Your message was sent!
zu: Umyalezo wakho uthunyelwe!

source: You rock! We'll send an email to let you know if your changes get approved. You can follow the discussion about this article by clicking the Discussion tab.
zu: Wena uhamba wedwa! Sizokuthumela i-imeyli ukukwazisa ukuthi izinguquko zakho zigunyaziwe yini. Ungalandela ingxoxo mayelana nale athikhili ngokuchofoza ithebhu Yengxoxo.

source: Your password was successfully reset.
zu: Iphasiwedi yakho isethwe kabusha ngempumelelo.

source: Your question is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Umbuzo wakho mfishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani ube %(limit_value)s izinhlamvu.

source: Your revision has been approved: {title}
zu: Isibukezo sakho sigunyaziwe: {title}

source: Your revision has been reviewed.
zu: Ukubukeza kwakho kubukeziwe.

source: Your revision has been reviewed: {title}
zu: Isibukezo sakho sibukweziwe: {title}

source: Your settings have been saved.
zu: Amasethingi akho aselondoloziwe.

source: Your title is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Isihloko sifishane kakhulu (%(show_value)s ezinhlamvu). Kufanele okungenani zibe %(limit_value)s ezinhlamvu.

source: Your username is:
zu: Igama lakho lomsebenzisi lithi:

source: Your username on %s
zu: Igama lakho lomsebenzisi ku %s

source: Your username will be shown next to your question in our public support forums.
zu: Igama lakho lomsebenzisi lizokhonjiswa eduze kombuzo wakho ezithangamini zethu zokweseka ezivulelekile.

source: Your Web browser doesn't appear to have cookies enabled. Cookies are required for logging in.
zu: Isiphequluli sakho sewebhu asibonakali sengathi siyahambelana namakhukhi. Amakhukhi ayadingeka ukuze ukwazi ukulogela ukungena.

source: You should receive an email shortly to confirm your subscription.
zu: Uzothola i-imeyli kungekudala nje ukuqinisekisa ngokubhalisa kwakho.

source: You've confirmed your email address and activated your account! You can now log in, and go edit your profile.
zu: Uqinisekisile ikheli lakho le-imeyli waqalisa ukusebenza kwe-akhawunti! Manje usungalogela ukunena, bese uhlela kahle iphrofayela yakho.

source: You were awarded the '{title}' badge!
zu: Uhlonyiliswe ibheji le '{title}'!

source: You will always control every tweet you post.
zu: Uyohlale ukwazi ukulawula wonke ama-tweet owaphostayo.

source: You will be notified of updates by email.
zu: Uzokwaziswa ngokwenzeka nge-imeyli.

source: You will be unsubscribed from: <br><strong>%(object)s</strong>
zu: Uzosuswa ohlwini lwababhalisele ukuthola imininingwane le: <br><strong>%(object)s</strong>

source: You will need to confirm the newly set email address to complete the change.
zu: Kuzodingeka uqinisekise ikheli le-imeyli elisethwe kabusha ukuze uphothule ukushintsha.

source: You will no longer receive email updates for this question: <a href="%(question_url)s">%(question_title)s</a>
zu: Ngeke usathunyelwa ma-imeyli akwazisa ngalo mbuzo: <a href="%(question_url)s">%(question_title)s</a>

source: You will now receive updates via email.
zu: Manje usuzothola izindaba zakamuva nge-imeyli.

source: About
zu: Mayelana

source: Donate
zu: Nikela

source: Features
zu: Izici

source: Learn more
zu: Funda kabanzi

source: Legal
zu: Ezomthetho

source: Menu
zu: Imenyu

source: Other languages:
zu: Ezinye izilimi:

source: Portions of this content are 1998%(current_year)s by individual mozilla.org contributors. Content available under a <a href="%(url)s">Creative Commons license</a>.
zu: Izingxenye zalokhu okuqukethwe 1998%(current_year)s kwenziwe ngabe-mozilla.org. Okuqukethwe kuyatholakala ngaphansi kwe<a href="%(url)s">Creative Commons license</a>.

source: Releases
zu: Okukhishiwe

source: Themes
zu: Izindikimba

source: Thunderbird is now part of <a href="%(mzla)s" class="inline-link">MZLA Technologies Corporation</a>, a wholly owned subsidiary of Mozilla Foundation. Portions of this content are 1998%(current_year)s by individual contributors. Content available under a <a href="%(url)s" class="inline-link">Creative Commons license</a>.
zu: Izingxenye zalokhu okuqukethwe 1998%(current_year)s kwenziwe ngabe-mozilla.org. Okuqukethwe kuyatholakala ngaphansi kwe<a href="%(url)s">Creative Commons license</a>.

source: Whats New
zu: Yini entsha
